# 工商银行
icbc = {
    "证券名称": "工商银行",
    "证券代码": "601398",
    "行业": "商业银行",
    "上市日期": "2006-10-27",
    "每股收益（元）": 0.82,
    "不良贷款率": "1.52%",
    "拨备覆盖率": "175.76%",
    "资本充足率": "15.39%",
    "总资产收益率": "1.11%",
    "净资产收益率": "13.79%"
}

# 建设银行
ccb = {
    "证券名称": "建设银行",
    "证券代码": "601939",
    "行业": "商业银行",
    "上市日期": "2007-09-25",
    "每股收益（元）": 1.00,
    "不良贷款率": "1.46%",
    "拨备覆盖率": "208.37%",
    "资本充足率": "17.19%",
    "总资产收益率": "1.16%",
    "净资产收益率": "14.04%"
}

# 中国银行
boc = {
    "证券名称": "中国银行",
    "证券代码": "601988",
    "行业": "商业银行",
    "上市日期": "2006-07-05",
    "每股收益（元）": 0.59,
    "不良贷款率": "1.42%",
    "拨备覆盖率": "181.97%",
    "资本充足率": "14.97%",
    "总资产收益率": "0.94%",
    "净资产收益率": "12.06%"
}

# 农业银行
abc = {
    "证券名称": "农业银行",
    "证券代码": "601288",
    "行业": "商业银行",
    "上市日期": "2010-07-15",
    "每股收益（元）": 0.59,
    "不良贷款率": "1.59%",
    "拨备覆盖率": "252.18%",
    "资本充足率": "15.12%",
    "总资产收益率": "0.93%",
    "净资产收益率": "13.66%"
}
print(icbc["行业"]==ccb["行业"])
print(icbc["上市日期"]==boc["上市日期"])
print(ccb["每股收益（元）"]>abc["每股收益（元）"])
print(ccb["不良贷款率"]<=abc["不良贷款率"])
print(ccb["拨备覆盖率"]<=abc["拨备覆盖率"])
print(icbc["资本充足率"]<abc["资本充足率"])
print(icbc["总资产收益率"]<ccb["总资产收益率"])
print(boc["净资产收益率"]<=ccb["净资产收益率"])